Долома/src/Catalogs/СхемыСинхронизации/СхемыСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыСинхронизации</name>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Инъекции</name>
    <attributes>
      <name>День</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инъекция</name>
      <type>
        <types>EnumRef.ВидыИнъекцийСхемСинхронизации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Долома/src/Catalogs/СхемыСинхронизации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ИнъекцииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)  
	
	РассчитатьДлительностьСхемы();
	
КонецПроцедуры  

&НаКлиенте
Процедура ИнъекцииПослеУдаления(Элемент)
	
	РассчитатьДлительностьСхемы();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлительностьСхемы()
	
	Объект.Длительность = 0;
	Для каждого Строчка Из Объект.Инъекции Цикл
		Объект.Длительность = Макс(Объект.Длительность, Строчка.День);	
	КонецЦикла;	

КонецПроцедуры
